# 100 pandas puzzles

Here are 100* short puzzles for testing your knowledge of [pandas'](http://pandas.pydata.org/) power.

Since pandas is a large library with many different specialist features and functions, these excercises focus mainly on the fundamentals of manipulating data (indexing, grouping, aggregating, cleaning), making use of the core DataFrame and Series objects. 

Many of the excerises here are stright-forward in that the solutions require no more than a few lines of code (in pandas or NumPy... don't go using pure Python!). Choosing the right methods and following best practices is the underlying goal.

The exercises are loosely divided in sections. Each section has a difficulty rating; these ratings are subjective, of course, but should be a seen as a rough guide as to how inventive the required solution is.

If you are looking for some other resources with pandas, the official documentation  is very extensive. In particular, some good places get a broader overview of pandas are...

- [10 minutes to pandas](http://pandas.pydata.org/pandas-docs/stable/10min.html)
- [pandas basics](http://pandas.pydata.org/pandas-docs/stable/basics.html)
- [tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html)
- [cookbook and idioms](http://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook)

Enjoy the puzzles!

## Importing pandas

### Getting started and checking your pandas setup

Difficulty: *easy* 

**1.** Import pandas under the name `pd`.

In [1]:
import pandas as pd
import numpy as np

**2.** Print the version of pandas that has been imported.

In [2]:
pd.__version__

'1.3.4'

**3.** Print out all the version information of the libraries that are required by the pandas library.

In [3]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : 945c9ed766a61c7d2c0a7cbb251b6edebf9cb7d5
python           : 3.9.7.final.0
python-bits      : 64
OS               : Darwin
OS-release       : 21.1.0
Version          : Darwin Kernel Version 21.1.0: Wed Oct 13 17:33:24 PDT 2021; root:xnu-8019.41.5~1/RELEASE_ARM64_T8101
machine          : x86_64
processor        : i386
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : None.UTF-8

pandas           : 1.3.4
numpy            : 1.21.3
pytz             : 2021.3
dateutil         : 2.8.2
pip              : 21.3.1
setuptools       : 58.4.0
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : None
IPython          : 7.29.0
pandas_datareader: None
bs4              : None
bottleneck       : None
fsspec           : None
fastparquet      : None
gcsfs            : None
matplotlib       : None
numexpr          : None
odfpy            : None
openpyxl         : None
pandas_gbq       : None
pyarrow          : None
pyxlsb           : None
s3fs             : None
scipy            : None
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
numba            : None

## DataFrame basics

### A few of the fundamental routines for selecting, sorting, adding and aggregating data in DataFrames

Difficulty: *easy*

Note: remember to import numpy using:
```python
import numpy as np
```

Consider the following Python dictionary `data` and Python list `labels`:

``` python
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```
(This is just some meaningless data I made up with the theme of animals and trips to a vet.)

**4.** Create a DataFrame `df` from this dictionary `data` which has the index `labels`.

In [4]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

**5.** Display a summary of the basic information about this DataFrame and its data.

In [8]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

**6.** Return the first 3 rows of the DataFrame `df`.

In [7]:
df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

**7.** Select just the 'animal' and 'age' columns from the DataFrame `df`.

In [9]:
df[ ['age' , 'animal'] ]

   age animal
a  2.5    cat
b  3.0    cat
c  0.5  snake
d  NaN    dog
e  5.0    dog
f  2.0    cat
g  4.5  snake
h  NaN    cat
i  7.0    dog
j  3.0    dog

**8.** Select the data in rows `[3, 4, 8]` *and* in columns `['animal', 'age']`.

In [15]:
df.loc[['c','d','h'],['animal','age']]

  animal  age
c  snake  0.5
d    dog  NaN
h    cat  NaN

**9.** Select only the rows where the number of visits is greater than 2.

In [20]:
df[df['visits'] > 2]

  animal  age  visits  priority
b    cat  3.0       3      True
d    dog  NaN       3      True
f    cat  2.0       3     False

**10.** Select the rows where the age is missing, i.e. is `NaN`.

In [21]:
df[df['age'].isnull()]

  animal  age  visits  priority
d    dog  NaN       3      True
h    cat  NaN       1      True

**11.** Select the rows where the animal is a cat *and* the age is less than 3.

In [22]:
df[(df['animal'] == 'cat') & (df['age'] < 3)]

  animal  age  visits  priority
a    cat  2.5       1      True
f    cat  2.0       3     False

**12.** Select the rows the age is between 2 and 4 (inclusive).

In [23]:
df[df['age'].between(2, 4)]

  animal  age  visits  priority
a    cat  2.5       1      True
b    cat  3.0       3      True
f    cat  2.0       3     False
j    dog  3.0       1     False

**13.** Change the age in row 'f' to 1.5.

In [24]:
df.loc['f', 'age'] = 1.5

**14.** Calculate the sum of all visits (the total number of visits).

In [25]:
df['visits'].sum()

19

**15.** Calculate the mean age for each different animal in `df`.

In [26]:
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

**16.** Append a new row 'k' to `df` with your choice of values for each column. Then delete that row to return the original DataFrame.

In [27]:
df.loc['k'] = [5.5, 'dog', 'no', 2]
df = df.drop('k')

**17.** Count the number of each type of animal in `df`.

In [28]:
df['animal'].value_counts()

cat      4
dog      4
snake    2
Name: animal, dtype: int64

**18.** Sort `df` first by the values in the 'age' in *decending* order, then by the value in the 'visit' column in *ascending* order.

In [29]:
df.sort_values(by=['age', 'visits'], ascending=[False, True])

  animal  age visits  priority
i    dog  7.0      2         0
e    dog  5.0      2         0
g  snake  4.5      1         0
j    dog  3.0      1         0
b    cat  3.0      3         1
a    cat  2.5      1         1
f    cat  1.5      3         0
c  snake  0.5      2         0
h    cat  NaN      1         1
d    dog  NaN      3         1

**19.** The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be `True` and 'no' should be `False`.

In [18]:
df['priority'] = df['priority'].map({'yes': True, 'no': False})
df['priority']

a     True
b     True
c    False
d     True
e    False
f    False
g    False
h     True
i    False
j    False
Name: priority, dtype: bool

**20.** In the 'animal' column, change the 'snake' entries to 'python'.

In [30]:
df['animal'] = df['animal'].replace('snake', 'python')

**21.** For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

In [31]:
df.pivot_table(index='animal', columns='visits', values='age', aggfunc='mean')

visits    1    2     3
animal
cat     2.5  NaN  2.25
dog     3.0  6.0   NaN
python  4.5  0.5   NaN

## DataFrames: beyond the basics

### Slightly trickier: you may need to combine two or more methods to get the right answer

Difficulty: *medium*

The previous section was tour through some basic but essential DataFrame operations. Below are some ways that you might need to cut your data, but for which there is no single "out of the box" method.

**22.** You have a DataFrame `df` with a column 'A' of integers. For example:
```python
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

How do you filter out rows which contain the same integer as the row immediately above?

In [41]:
df.loc[df['A'].shift() != df['A']]

     A         B
0    0  0.427353
1    1  0.448187
2    2  0.145939
3    3  0.891398
4    4  0.431001
5    5  0.783470
6    6  0.402916
7    7  0.614377
8    8  0.760582
9    9  0.280858
10  10  0.378299
11  11  0.169150
12  12  0.677236
13  13  0.571792
14  14  0.088335
15  15  0.441781
16  16  0.438470
17  17  0.703981
18  18  0.807075
19  19  0.828653
20  20  0.178594
21  21  0.346407
22  22  0.487423
23  23  0.026076
24  24  0.438713
25  25  0.879463
26  26  0.707001
27  27  0.711245
28  28  0.252714
29  29  0.240192

**23.** Given a DataFrame of numeric values, say
```python
df = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values
```

how do you subtract the row mean from each element in the row?

In [42]:
df.sub(df.mean(axis=1), axis=0)

            A          B
0   -0.213677   0.213677
1    0.275906  -0.275906
2    0.927030  -0.927030
3    1.054301  -1.054301
4    1.784500  -1.784500
5    2.108265  -2.108265
6    2.798542  -2.798542
7    3.192812  -3.192812
8    3.619709  -3.619709
9    4.359571  -4.359571
10   4.810850  -4.810850
11   5.415425  -5.415425
12   5.661382  -5.661382
13   6.214104  -6.214104
14   6.955833  -6.955833
15   7.279109  -7.279109
16   7.780765  -7.780765
17   8.148009  -8.148009
18   8.596462  -8.596462
19   9.085674  -9.085674
20   9.910703  -9.910703
21  10.326796 -10.326796
22  10.756289 -10.756289
23  11.486962 -11.486962
24  11.780644 -11.780644
25  12.060269 -12.060269
26  12.646500 -12.646500
27  13.144377 -13.144377
28  13.873643 -13.873643
29  14.379904 -14.379904

**24.** Suppose you have DataFrame with 10 columns of real numbers, for example:

```python
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
```
Which column of numbers has the smallest sum? (Find that column's label.)

In [43]:
df.sum().idxmin()

'B'

**25.** How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?

In [49]:
len(df.drop_duplicates(keep=False))

30

The next three puzzles are slightly harder...

**26.** You have a DataFrame that consists of 10 columns of floating--point numbers. Suppose that exactly 5 entries in each row are NaN values. For each row of the DataFrame, find the *column* which contains the *third* NaN value.

(You should return a Series of column labels. Try not to use `.iterrows()`)

In [50]:
data = {
1:[np.nan,2,np.nan,4,5],
2:[np.nan,2,3,np.nan,5],
3:[np.nan,2,np.nan,4,5],
4:[1,np.nan,3,np.nan,np.nan],
5:[1,2,np.nan,4,5],
6:[1,np.nan,3,np.nan,np.nan],
7:[1,2,3,4,5],
8:[1,np.nan,3,np.nan,np.nan],
9:[1,2,3,4,np.nan],
10:[1,np.nan,3,4,5]}

(df.isnull().cumsum(axis=1) == 3).idxmax(axis=1)

0     A
1     A
2     A
3     A
4     A
5     A
6     A
7     A
8     A
9     A
10    A
11    A
12    A
13    A
14    A
15    A
16    A
17    A
18    A
19    A
20    A
21    A
22    A
23    A
24    A
25    A
26    A
27    A
28    A
29    A
dtype: object

**27.** A DataFrame has a column of groups 'grps' and and column of numbers 'vals'. For example: 

```python
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
```
For each *group*, find the sum of the three greatest values.

In [54]:
df.groupby('grps')['vals'].nlargest(3).sum(level=0)

/var/folders/__/q073lyzj7c74b2fw62ln7gph0000gn/T/ipykernel_37101/1593056217.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  df.groupby('grps')['vals'].nlargest(3).sum(level=0)

grps
a    409
b    156
c    345
Name: vals, dtype: int64

**28.** A DataFrame has two integer columns 'A' and 'B'. The values in 'A' are between 1 and 100 (inclusive). For each group of 10 consecutive integers in 'A' (i.e. `(0, 10]`, `(10, 20]`, ...), calculate the sum of the corresponding values in column 'B'.

In [56]:
import numpy as np
data = {"A":np.arange(0,30), "B":np.random.random(30)}

df = pd.DataFrame(data)
df

     A         B
0    0  0.707162
1    1  0.360681
2    2  0.049610
3    3  0.993574
4    4  0.366279
5    5  0.541694
6    6  0.327923
7    7  0.249318
8    8  0.240935
9    9  0.021458
10  10  0.132886
11  11  0.873224
12  12  0.393108
13  13  0.204314
14  14  0.885910
15  15  0.007138
16  16  0.463827
17  17  0.069339
18  18  0.091516
19  19  0.686347
20  20  0.302217
21  21  0.190037
22  22  0.079805
23  23  0.438225
24  24  0.143587
25  25  0.824896
26  26  0.058185
27  27  0.569389
28  28  0.657614
29  29  0.906802

In [57]:
df.groupby(pd.cut(df['A'], np.arange(0, 101, 10)))['B'].sum()

A
(0, 10]      3.284358
(10, 20]     3.976941
(20, 30]     3.868538
(30, 40]     0.000000
(40, 50]     0.000000
(50, 60]     0.000000
(60, 70]     0.000000
(70, 80]     0.000000
(80, 90]     0.000000
(90, 100]    0.000000
Name: B, dtype: float64